{
  "question": [
    "I am writing to request your review of my course tracking in preparation for graduation. I am pursuing a double major in Computer Science and Applied Mathematics. I have attached the spreadsheet tracking my courses for your review. I would appreciate it if you could take a look and provide any necessary feedback: Humility, Global Humanities and Social Change, Linear Algebra, Modern Vietnamese Culture and Society, Quantitative Reasoning for a Digital Age, Discrete Math, Computer Science II: Data Structures, Programming for Data Science and Visualization, Design and Systems Thinking, Scientific Inquiry, Computer Organization, Calculus, Intelligent Robot Studio: From Theory to Practice, How to become a writer: lessons from Vietnamese and non-Vietnamese writers, Introduction to Political Science, The Global Vietnam War II, Deep Learning for Artificial Intelligence, Advanced Deep Learning, Probability, Computer Science I: Introduction to Programming, Algorithms and Theory of Computing, Database System, Advanced Programming Techniques, Introduction to Artificial Intelligence, Machine Learning for Data Science, Multivariable Calculus, Mathematical Statistics, General Work Program (GWP) 1, [Independent Research Project] Labeled FreSCo- Mining Frequent Patterns in labeled Simplicial Complexes, Object-Oriented Analysis and Design, Statistical Learning, Operating Systems, Abstract Algebra, Differential Equations, Stochastic Calculus, Natural Language Processing, Advanced Linear Algebra.",
        "Can you differentiate a cross-listed course and elective applied course in the case of a double major?",
        "I would like to ask for the capstone withdrawal policy. What will be the impact when I choose to drop the capstone before the Fall 2025 term starts? Will there be any penalties associated with withdrawing, such as a 'W' notation on my transcript?",
        "Questions related to course history, in which one course can have multiple IDs? Like Advanced Deep Learning course. How would it be handled among different cohorts?",
        "I have taken Microeconomic Analysis and Macroeconomic Analysis in Fall 2023. Am I eligible to take Financial Economics in Spring 2024?",
        "If I have waived the course Computer Science I, but I want to declare Computer Science major, do I have to take Computer Science I?",
        "If I have taken the following courses: Mathematical Statistics, Abstract Algebra, Linear Algebra, Multivariable Calculus, Calculus, Differential Equation, Stochastic Calculus, Statistical Learning, Discrete Mathematics, Probability, am I eligible to declare a minor in Applied Mathematics?",
        "\"If I have taken the following courses: Mathematical Statistics, Abstract Algebra, Linear Algebra, Multivariable Calculus, Calculus, Differential Equation, Stochastic Calculus, Statistical Learning, Discrete Mathematics, Probability, am I eligible to declare a major in Applied Mathematics?",
        "I have completed these 100-level courses: Introduction to Art History and Theory, Introduction to Film History and Theory. Am I eligible to start a Capstone in my major Arts and Media Studies?",
        "Is it possible that I write a book as my History Capstone?",
        "Given I have finished these subjects: Advanced Deep Learning, Machine Learning, Deep Learning, Database. Are they sufficient for the Advanced Courses requirement of the computer science major?",
        "I have a question if I take a gap year, will my financial aid be canceled? If yes, can I still re-apply for the financial aid program when I get back to school?",
        "I am aware that Fulbright has to organize online classes instead of on-campus ones. Therefore, will there be any change in the tuition fee?",
        "If I major in Economics, is it sufficient that I take Scholar Development to fulfill Experiential Learning requirements?",
        "Is it sufficient for me to complete 4 credits in EL if I major in Engineering?",
        "Can I take all four engineering foundation courses and only two intermediate engineering courses?",
        "If I have completed the course Intro to AI, will CS207 - Object-Oriented Analysis and Design and CS211 – Operating Systems suffice to fill the rest two intermediate courses?",
        "Does completing both Microeconomics and Macroeconomics satisfy the core theory requirement, or is an additional course needed?",
        "If I want to major in HCE, can I choose other programming courses besides Computer Science I and Computer Science II, for instance Introduction to data visualization?",
        "Given I took Discrete Mathematics in Spring 2022 and earned B, then the same course in Spring 2024 and earned C-, which grades will be kept?",
        "Can I register 300-level math courses as exploratory courses E4?",
        "Can I register for more than 20 credits in a semester?",
        "What is the maximum number of times I can retake a course to improve my grade, and how does it affect my transcript?",
        "For a student doing the literature capstone, if a student includes charts or tables, do they count toward the word limit?",
        "If I failed Capstone I in the Fall 2024, can I redo it in Spring 2025?",
        "If I do Literature capstone in Decolonial studies, can it be approved?",
        "I am a Co24 majoring in Computer Science and taking the Database course. Does it count as major courses?",
        "Can Discrete Mathematics be counted for both Computer Science and Applied Mathematics majors?",
        "What steps should I take to ensure a smooth transfer of my exchange semester credits from Bard College to Fulbright?",
        "Are 100-level and 200-level courses that are not explicitly categorized as E1, E2, E3, or E4 also excluded from fulfilling the Exploratory requirement?",
        "I am a Co25 student pursuing a Computer Science major, can I choose to follow either the old flowchart or the new one?",
        "If I withdraw from a course after the 4th week of the semester, will I be deducted 4 credits of financial aid?",
        "Why do I need to take 8 exploratory courses?",
        "Can I take 160 credits in 4 years given that I pay for the full tuition fee?",
        "What are the requirements for mathematics courses to pursue HCE major?",
        "How is the grade of a replaced course displayed on the transcript? Will it replace the old one or create a new entry in the transcript?",
        "What are the courses that can replace the capstone for a given major?",
        "Is it possible to graduate with double majors in HCE and Applied Mathematics? If yes, please provide a sample study plan.",
        "Are the 4-credit EL counted towards the credits covered by financial aid?",
        "What are the exchange policies of Fulbright?",
        "What actions are considered plagiarism? Are AI-generated works counted?",
        "Why is the graduation requirement 128 credits, but the major requirement is only 48 credits?",
        "Explain the cross-listed mechanism between courses.",
        "When is the graduation ceremony for Co25?",
        "How does the core quest course selection work to fulfill core credits?",
        "Can I take a 300-level course to fulfill a 200-level major requirement?",
        "If I take a course at another university and want to transfer the credits to Fulbright, but Fulbright doesn’t have that major code, yet the course is related to a major at Fulbright, can I count it toward that major?",
        "I have 112 credits from Fulbright and 16 credits from EL. Can I graduate?",
        "I have received an offer to attend an international conference but lack funding. What school funds can I apply for?",
        "What is the maximum number of credits I can transfer from another university after officially enrolling at Fulbright?",
        "In a regular semester, can I take only 2 courses? If so, how will my tuition fees be affected?",
        "Can I pursue 3 majors?",
        "How can I change my major declaration?",
        "What is the process of delaying my payment?",
        "Which major has the fewest requirements?",
        "How many courses can I take in total?",
        "How many courses in a semester can I take in total?",
        "How many courses does the university offer?",
        "How can I audit a course?",
        "If I'm going for a double major then how many courses can be double count maximum?",
        "Can you give me the grade translation from alphabetic to numerical?",
        "What grade is A in scale of 4?",
        "Why and how am I getting academic suspension?",
        "How does the P/NP grade work?",
        "How many courses can I take as P/NP at maximum and how will it contribute to the official transcript GPA?",
        "I've failed the GWP due to personal reasons so will it count toward the 144 maximum credits I can have?",
        "What and how do I get an Academic Warning?",
        "How can I make reservations of rooms for personal usage?",
        "Can you provide me with some courses suggestion to take to major in Math?",
        "How to declare a major in CS?",
        "I'm currently under a General Work Program for Experiential Learning but the company do not pay me in any form. How can I get the subsidy from Fulbright University?",
        "Can you give me the process of making a Capstone for graduation?",
        "What are the grades required to get a distinctive graduation?",
        "How can I graduate with Honor or lie within the top GPA?",
        "How many courses can I take with P/NP grade in total?",
        "How many types of absences are there?",
        "How many types of leave of absence are there and how can I have one?",
        "How can I report violation of Academic environment anonymously?",
        "Where can I get all forms and pdf related to my academic journey at Fulbright?",
        "What is the school's policy on academic dishonesty, and how are violations handled?",
        "What are the policies regarding retaking exams or improving grades?",
        "How does the university accommodate students with chronic illnesses or personal emergencies that affect attendance?",
        "Are students allowed to use AI tools like ChatGPT for assignments? If so, under what conditions?",
        "Where can I get support for mental health treatment?",
        "Where can I get the information about motorcycle parking?",
        "Where can I find resources to facilitate my graduate program after Fulbright undergraduate?",
        "Can you give me information about teaching assistant program right now?",
        "Where can I get the assist for internship?",
        "How can I get the information of campus usage for events so that I can have proper place to study without getting interrupted?",
        "I used to take an undergraduate program at another university and I want to transfer credit of studied courses at that university. What should I do?",
        "What are the policies of CWP?",
        "I'm a student athlete then how can I bypass all of physical education courses required to graduate?",
        "I'm currently a third year student and moved out of university dormitory after first year but now I'm struggling to find a new accommodation so can I register again for dormitory and will I still have the financial support?",
        "Can you give me the procedure to request for funds to support club activities?",
        "How many ways are there provided by the university can I get the support in my academic path?",
        "Can you give me the information about student fees and charges policy?",
        "I've lost my student Id card which department should I contact to get back my card?",
        "I'm having some bad experience with a professor teaching a course. The problem was his way of delivering does not meet academic standard and I want to say something about this with people having higher authorities. What should I do?",
        "I'm a third year student and don't know if I should do a capstone project then where should I go to get advice?",
        "I'm a member of Fulbright Basketball Club and going to attend a tournament. I need the official transcript and asking for some absence in classes then where should I get help?",
        "How many types of salary does the university have when I'm working for the university?",
        "How can I borrow books from the library?",
        "How to work with major report?",
        "How many way can I fill in the requirements of EL?"
  ]
}